In [4]:
import pandas as pd
import os

In [7]:
df = pd.read_csv("bank_data.csv",sep=';')
df.head(3)

,age,job,marital,education,default,balance,housing,loan,contact,day,month,duration,campaign,pdays,previous,poutcome,y
0,30,unemployed,married,primary,no,1787,no,no,cellular,19,oct,79,1,-1,0,unknown,no
1,33,services,married,secondary,no,4789,yes,yes,cellular,11,may,220,1,339,4,failure,no
2,35,management,single,tertiary,no,1350,yes,no,cellular,16,apr,185,1,330,1,failure,no

In [8]:
df['y'].value_counts()

no     4000
yes     521
Name: y, dtype: int64

In [9]:
df['y'].value_counts(normalize=True)

no     0.88476
yes    0.11524
Name: y, dtype: float64

In [10]:
pd.crosstab(df['job'],df['y'],normalize='index').round(3)

y                 no    yes
job
admin.         0.879  0.121
blue-collar    0.927  0.073
entrepreneur   0.911  0.089
housemaid      0.875  0.125
management     0.865  0.135
retired        0.765  0.235
self-employed  0.891  0.109
services       0.909  0.091
student        0.774  0.226
technician     0.892  0.108
unemployed     0.898  0.102
unknown        0.816  0.184

In [12]:
pd.crosstab(df['marital'],df['y'],normalize=True).round(3)

y            no    yes
marital
divorced  0.100  0.017
married   0.557  0.061
single    0.228  0.037

In [13]:
pd.crosstab(df['marital'],df['y'],normalize='index').round(3)

y            no    yes
marital
divorced  0.854  0.146
married   0.901  0.099
single    0.860  0.140